/**
 ******************************************************************************
 * @file    main.c
 * @author  Lichangchun
 * @version
 * @date    13-April-2017
 * @brief
 ******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "delay.h"
#include "led.h"
#include "usart.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
 * @brief    --> 主函数
 * @param    --> None
 * @retval   --> None
 *******************************************************************************/
int main(void)
{
    delay_init();
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    USART1_Configuration(9600);
    printf("Hello World!\r\n");
    LED_Init();
    LED_Off();

    while (1)
    {
        LED_Flip();
        delay_ms(500);
        LED_Flip();
        delay_ms(250);
        LED_Flip();
        delay_ms(250);
        LED_Flip();
        delay_ms(500);
    }
}
